app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
  def index
    # @users = User.all
    @users = User.search('*').records

INSERT INTO "users" ("name", "email", "desription", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Test user1"], ["email", "aryan@mail.com"], ["desription", "description of user is here"], ["created_at", "2021-11-16 11:17:48.475571"], ["updated_at", "2021-11-16 11:17:48.475571"]]
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save